LUN_DAY_DICT = {'初二': 2, '初三': 3, '初四': 4, '初五': 5, '初六': 6,
          '初七': 7, '初八': 8, '初九': 9, '初十': 10, '十一': 11,
          '十二': 12, '十三': 13, '十四': 14, '十五': 15, '十六': 16,
          '十七': 17, '十八': 18, '十九': 19, '二十': 20, '廿一': 21,
          '廿二': 22, '廿三': 23, '廿四': 24, '廿五': 25, '廿六': 26,
          '廿七': 27, '廿八': 28, '廿九': 29, '三十': 30}

LUN_MON_DICT = {'正月': 1, '二月': 2, '三月': 3, '四月': 4,
          '五月': 5, '六月': 6, '七月': 7, '八月': 8,
          '九月': 9, '十月': 10, '十一月': 11, '十二月': 12,

          '閏正月': 101, '閏二月': 102, '閏三月': 103, '閏四月': 104,
          '閏五月': 105, '閏六月': 106, '閏七月': 107, '閏八月': 108,
          '閏九月': 109, '閏十月': 110, '閏十一月': 111, '閏十二月': 112}

WEEK_DAY = {'星期日':0, '星期一':1, '星期二':2, '星期三':3, '星期四':4, '星期五':5, '星期六':6}


SOLAR_TREMS = ['小寒', '大寒', '立春', '雨水', '驚蟄', '春分', '清明', '穀雨', '立夏', '小滿', '芒種', '夏至', '小暑', '大暑', '立秋', '白露', '秋分', '寒露', '霜降', '立冬', '小雪', '大雪', '冬至']
